SwB_air_tangential_inlet_r96_pimple/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "1e-06";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (37.9 0 0);

boundaryField
{
    inlet
    {
        type            turbulentInlet;
        fluctuationScale (0.2 0 0);
        referenceField  uniform (37.9 0 0);
        alpha           0.1;
        value           uniform (37.9 0 0);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    axis
    {
        type            slip;
    }
    front
    {
        type            slip;
    }
    back
    {
        type            slip;
    }
}


// ************************************************************************* //
